from selenium.webdriver.common.by import By


class AccountLocators:
    """
    Класс содержит локаторы элементов страницы личного кабинета.
    """

    # Локатор для ссылки на профиль пользователя
    PROFILE_LINK = (
        By.XPATH,
        "//a[text()='Профиль']"
    )
    """Ссылка на профиль пользователя."""

    # Локатор для ссылки на историю заказов
    ORDER_HISTORY_LINK = (
        By.XPATH,
        "//a[text()='История заказов']"
    )
    """Ссылка на историю заказов."""

    # Локатор для кнопки выхода из системы
    EXIT_BUTTON = (
        By.XPATH,
        "//button[text()='Выход']"
    )
    """Кнопка выхода из системы."""
